import random
number = random.randint(1,19)
count = 0 
guess = 0 
print("আপনি কি আমাদের সাথে গ্রুপে অংশগ্রহণ করতে চান?")
print("প্লিজ!টাইপ করেন:\"yes\" এবং \"no\"" )
df =str(input())        
if df == "yes":
      print("ওকে! তার আগে আপনাকে  আমাদের সাথে একটা গেম খেলতে হবে।")
      print("আপনি কি ঐ গেমটা খেলতে চান? টাইপ করেন:\"yes\" এবং \"no\"")
      rules = str(input())
      if rules == "yes":
            print("\n\nসাবাস!শুনে ভাল লাগলো।")
            print("প্রথমে খেলার নিয়মটা বোঝে নিন!\n")
            print("একটা এলোমেলো উত্তর থাকবে। কিন্তু সেই উত্তরটা ১ থেকে ২০ \nপর্যন্তই আছে।")
            print("এবং আপনাকে সেই উত্তরটা বের করতে হবে")
            print("আপনি যদি ২০ এর বাহিরের কোন নাম্বার দেন। তাহলে আপনি খেলা থেকে বাদ পরে যাবেন।তাই সাবধান!")
            print("খেলাটা আপনি খেলতে পারবেন মাত্র তিনবার তারপরে এটা বন্ধ হয়ে \nযাবে।ধন্যবাদ পড়ার জন্য!\n\n")
            print("আপনি কি খেলার জন্য প্রস্তুত?টাইপ করেন:\"yes\" এবং \"no\":")
            ready = str(input())
            if ready == "yes":
                  while guess != number:
                        count +=1 
                        guess = int(input("টাইপ করেন! ১ থেকে ২০ পর্যন্ত যে কোন নাম্বার: "))
                        if guess >= 21 :
                              print("নিয়মটা ভাল করে পরেন! আসা করি,পরের বার আপনি পারবেন।Bye!😒")
                              break
                        if guess == number:
                              print("You are Right😍")
                              print("Welcome our Group!")
                              break
                  
                        elif guess > number: 
                              print("উত্তরটার থেকে আপনার বাছাইকৃত নাম্বারটা বড়!")
                        elif guess < number:
                              print("উত্তরটার থেকে আপনার বাছাইকৃত নাম্বারটা ছোট!")
                        if count == 3:
                              print("আপনি চেষ্টা করেছেন: ",count)
                              print("আপনার তিনবার শেষ হয়ে গেয়েছে। দয়া করে,পরের বার চেষ্টা করেন।ধন্যবাদ আমাদের সাথে থাকার জন্য!😊")
                              print("আপনার উত্তরটা হবে:-",number)
                              break
                        else: 
                              print("আপনি চেষ্টা করেছেন: ",count)
            else:
                  print("ধন্যবাদ আপনাকে!আসা করি,আপনি অনেক ভাল থাকবেন")                  
      else:
            print("ওকে যেমন আপনার ইচ্ছে!আসা করি,আপনি অনেক ভাল থাকবেন।")                  
else:
      print("সাবাস😊!আসা করি,আপনি অনেক ভাল থাকবেন।")
